Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: مطاع ثم أمين
en: Obeyed (by the angels in the heavens), and trustworthy.

source: وما صاحبكم بمجنون
en: And (O people) your companion (Muhammad صلى الله عليه وسلم) is not a madman.

source: ولقد رآه بالأفق المبين
en: And indeed he (Muhammad صلى الله عليه وسلم) saw him [Jibril (Gabriel)] in the clear horizon (towards the east).

source: وما هو على الغيب بضنين
en: And he (Muhammad صلى الله عليه وسلم) withholds not a knowledge of the Unseen.

source: وما هو بقول شيطان رجيم
en: And it (the Qur'an) is not the word of the outcast Shaitan (Satan).

source: فأين تذهبون
en: Then where are you going?

source: لمن شاء منكم أن يستقيم
en: To whomsoever among you who wills to walk straight.

source: وما تشاءون إلا أن يشاء الله رب العالمين
en: And you cannot will unless (it be) that Allah wills - the Lord of the 'Alamin (mankind, jinn and all that exists).

source: إذا السماء انفطرت
en: When the heaven is cleft asunder.

source: وإذا الكواكب انتثرت
en: And when the stars have fallen and scattered.

source: وإذا البحار فجرت
en: And when the seas are burst forth.

source: وإذا القبور بعثرت
en: And when the graves are turned upside down (and bring out their contents)

source: علمت نفس ما قدمت وأخرت
en: (Then) a person will know what he has sent forward and (what he has) left behind (of good or bad deeds).

source: يا أيها الإنسان ما غرك بربك الكريم
en: O man! What has made you careless about your Lord, the Most Generous?

source: الذي خلقك فسواك فعدلك
en: Who created you, fashioned you perfectly, and gave you due proportion.

source: في أي صورة ما شاء ركبك
en: In whatever form He willed, He put you together.

source: كلا بل تكذبون بالدين
en: Nay! But you deny Ad-Din (i.e. the Day of Recompense).

source: وإن عليكم لحافظين
en: But verily, over you (are appointed angels in charge of mankind) to watch you,

source: كراما كاتبين
en: Kiraman (Honourable) Katibin writing down (your deeds),

source: يعلمون ما تفعلون
en: They know all that you do.

source: إن الأبرار لفي نعيم
en: Verily, the Abrar (the pious believers of Islamic Monotheism) will be in Delight (Paradise);

source: وإن الفجار لفي جحيم
en: And verily, the Fujjar (the wicked, disbelievers, polytheists, sinners and evil-doers) will be in the blazing Fire (Hell),

source: يصلونها يوم الدين
en: Therein they will enter, and taste its burning flame on the Day of Recompense,

source: وما هم عنها بغائبين
en: And they (Al-Fujjar) will not be absent therefrom.

source: وما أدراك ما يوم الدين
en: And what will make you know what the Day of Recompense is?

source: ثم ما أدراك ما يوم الدين
en: Again, what will make you know what the Day of Recompense is?

source: يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله
en: (It will be) the Day when no person shall have power (to do) anything for another, and the Decision, that Day, will be (wholly) with Allah.

source: ويل للمطففين
en: Woe to Al-Mutaffifun (those who give less in measure and weight).

source: الذين إذا اكتالوا على الناس يستوفون
en: Those who, when they have to receive by measure from men, demand full measure,

source: وإذا كالوهم أو وزنوهم يخسرون
en: And when they have to give by measure or weight to (other) men, give less than due.

source: ألا يظن أولئك أنهم مبعوثون
en: Do they not think that they will be resurrected (for reckoning),

source: ليوم عظيم
en: On a Great Day?

source: يوم يقوم الناس لرب العالمين
en: The Day when (all) mankind will stand before the Lord of the 'Alamin (mankind, jinn and all that exists)?

source: كلا إن كتاب الفجار لفي سجين
en: Nay! Truly, the Record (writing of the deeds) of the Fujjar (disbelievers, polytheists, sinners, evil-doers and the wicked) is (preserved) in Sijjin.

source: وما أدراك ما سجين
en: And what will make you know what Sijjin is?

source: كتاب مرقوم
en: A Register inscribed.

source: الذين يكذبون بيوم الدين
en: Those who deny the Day of Recompense.

source: وما يكذب به إلا كل معتد أثيم
en: And none can deny it except every transgressor beyond bounds, (in disbelief, oppression and disobedience to Allah) the sinner!

source: كلا بل ران على قلوبهم ما كانوا يكسبون
en: Nay! But on their hearts is the Ran (covering of sins and evil deeds) which they used to earn.

source: كلا إنهم عن ربهم يومئذ لمحجوبون
en: Nay! Surely they (evil-doers) will be veiled from seeing their Lord that Day.

source: ثم إنهم لصالو الجحيم
en: Then, verily, they will indeed enter (and taste) the burning flame of Hell.

source: ثم يقال هذا الذي كنتم به تكذبون
en: Then, it will be said to them: "This is what you used to deny!"

source: كلا إن كتاب الأبرار لفي عليين
en: Nay! Verily, the Record (writing of the deeds) of Al-Abrar (the pious believers of Islamic Monotheism) is (preserved) in 'Illiyyun

source: وما أدراك ما عليون
en: And what will make you know what 'Illiyyun is?

source: يشهده المقربون
en: To which bear witness those nearest (to Allah, i.e. the angels).

source: على الأرائك ينظرون
en: On thrones, looking (at all things).

source: تعرف في وجوههم نضرة النعيم
en: You will recognise in their faces the brightness of delight.

source: يسقون من رحيق مختوم
en: They will be given to drink of pure sealed wine.

source: ختامه مسك وفي ذلك فليتنافس المتنافسون
en: The last thereof (that wine) will be the smell of Musk, and for this let (all) those strive who want to strive (i.e. hasten earnestly to the obedience of Allah).

source: ومزاجه من تسنيم
en: It (that wine) will be mixed with Tasnim:

source: عينا يشرب بها المقربون
en: A spring whereof drink those nearest to Allah.

source: إن الذين أجرموا كانوا من الذين آمنوا يضحكون
en: Verily, (during the worldly life) those who committed crimes used to laugh at those who believed.

source: وإذا مروا بهم يتغامزون
en: And, whenever they passed by them, used to wink one to another (in mockery).

source: وإذا انقلبوا إلى أهلهم انقلبوا فكهين
en: And when they returned to their own people, they would return jesting;

source: وإذا رأوهم قالوا إن هؤلاء لضالون
en: And when they saw them, they said: "Verily these have indeed gone astray!"

source: وما أرسلوا عليهم حافظين
en: But they (disbelievers, sinners) had not been sent as watchers over them (the believers).

source: فاليوم الذين آمنوا من الكفار يضحكون
en: But this Day (the Day of Resurrection) those who believe will laugh at the disbelievers

source: هل ثوب الكفار ما كانوا يفعلون
en: Are not the disbelievers paid (fully) for what they used to do?

source: إذا السماء انشقت
en: When the heaven is split asunder,

source: وأذنت لربها وحقت
en: And listens to and obeys its Lord - and it must do so.

source: وإذا الأرض مدت
en: And when the earth is stretched forth,

source: وألقت ما فيها وتخلت
en: And has cast out all that was in it and became empty.

source: يا أيها الإنسان إنك كادح إلى ربك كدحا فملاقيه
en: O man! Verily, you are returning towards your Lord with your deeds and actions (good or bad), a sure returning, and you will meet (the results of your deeds which you did).

source: فأما من أوتي كتابه بيمينه
en: Then as for him who will be given his Record in his right hand,

source: فسوف يحاسب حسابا يسيرا
en: He surely will receive an easy reckoning,

source: وينقلب إلى أهله مسرورا
en: And will return to his family in joy!

source: وأما من أوتي كتابه وراء ظهره
en: But whosoever is given his Record behind his back,

source: فسوف يدعو ثبورا
en: He will invoke (for his) destruction,

source: ويصلى سعيرا
en: And he shall enter a blazing Fire, and be made to taste its burning.

source: إنه كان في أهله مسرورا
en: Verily, he was among his people in joy!

source: إنه ظن أن لن يحور
en: Verily, he thought that he would never come back (to Us)!

source: بلى إن ربه كان به بصيرا
en: Yes! Verily, his Lord has been ever beholding him!

source: فلا أقسم بالشفق
en: So I swear by the afterglow of sunset;

source: والليل وما وسق
en: And by the night and whatever it gathers in its darkness,

source: والقمر إذا اتسق
en: And by the moon when it is at the full.

source: لتركبن طبقا عن طبق
en: You shall certainly travel from stage to stage (in this life and in the Hereafter).

source: فما لهم لا يؤمنون
en: What is the matter with them, that they believe not?

source: وإذا قرئ عليهم القرآن لا يسجدون
en: And when the Qur'an is recited to them, they fall not prostrate.

source: بل الذين كفروا يكذبون
en: Nay, those who disbelieve belie (Prophet Muhammad صلى الله عليه وسلم and whatever he brought, i.e. this Qur'an and Islamic Monotheism, etc.).

source: والله أعلم بما يوعون
en: And Allah knows best what they gather (of good and bad deeds),

source: فبشرهم بعذاب أليم
en: So announce to them a painful torment.

source: إلا الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Save those who believe and do righteous good deeds, for them is a reward that will never come to an end (i.e. Paradise).

source: والسماء ذات البروج
en: By the heaven holding the big stars.

source: واليوم الموعود
en: And by the Promised Day (i.e. the Day of Resurrection).

source: وشاهد ومشهود
en: And by the Witnessing day (i.e. Friday), and by the Witnessed day [i.e. the day of 'Arafat (Hajj) the ninth of Dhul-Hijjah];

source: قتل أصحاب الأخدود
en: Cursed were the people of the Ditch (in the story of the Boy and the King).

source: النار ذات الوقود
en: Of fire fed with fuel,

source: إذ هم عليها قعود
en: When they sat by it (fire),

source: وهم على ما يفعلون بالمؤمنين شهود
en: And they witnessed what they were doing against the believers (i.e. burning them).

source: وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد
en: And they had no fault except that they believed in Allah, the All-Mighty, Worthy of all Praise!

source: الذي له ملك السماوات والأرض والله على كل شيء شهيد
en: To Whom belongs the dominion of the heavens and the earth! And Allah is Witness over everything.

source: إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا فلهم عذاب جهنم ولهم عذاب الحريق
en: Verily, those who put into trial the believing men and believing women (by torturing them and burning them), and then do not turn in repentance (to Allah), then they will have the torment of Hell, and they will have the punishment of the burning Fire.

source: إن الذين آمنوا وعملوا الصالحات لهم جنات تجري من تحتها الأنهار ذلك الفوز الكبير
en: Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow (Paradise). That is the great success.

source: إن بطش ربك لشديد
en: Verily, (O Muhammad صلى الله عليه وسلم) the Seizure (punishment) of your Lord is severe and painful. [See V.11:102].

source: إنه هو يبدئ ويعيد
en: Verily, He it is Who begins (punishment) and repeats (punishment in the Hereafter) (or originates the creation of everything, and then repeats it on the Day of Resurrection).

source: وهو الغفور الودود
en: And He is Oft-Forgiving, full of love (towards the pious who are real true believers of Islamic Monotheism),

source: ذو العرش المجيد
en: Owner of the throne, the Glorious,

source: فعال لما يريد
en: (He is the) Doer of whatsoever He intends (or wills).

source: هل أتاك حديث الجنود
en: Has the story reached you of the hosts,

source: فرعون وثمود
en: Of Fir'aun (Pharaoh) and Thamud?

source: بل الذين كفروا في تكذيب
en: Nay! The disbelievers (persisted) in denying (Prophet Muhammad صلى الله عليه وسلم and his Message of Islamic Monotheism).

source: والله من ورائهم محيط
en: And Allah encompasses them from behind! (i.e. all their deeds are within His Knowledge, and He will requite them for their deeds).

source: بل هو قرآن مجيد
en: Nay! This is a Glorious Qur'an,

source: في لوح محفوظ
en: (Inscribed) in Al-Lauh Al-Mahfuz (The Preserved Tablet)!

source: والسماء والطارق
en: By the heaven, and At-Tariq (the night-comer, i.e. the bright star);

source: وما أدراك ما الطارق
en: And what will make you to know what At-Tariq (night-comer) is?

source: النجم الثاقب
en: (It is) the star of piercing brightness;

source: إن كل نفس لما عليها حافظ
en: There is no human being but has a protector over him (or her) (i.e. angels in charge of each human being guarding him, writing his good and bad deeds)

source: فلينظر الإنسان مم خلق
en: So let man see from what he is created!

source: خلق من ماء دافق
en: He is created from a water gushing forth,

source: يخرج من بين الصلب والترائب
en: Proceeding from between the backbone and the ribs.

source: إنه على رجعه لقادر
en: Verily, (Allah) is Able to bring him back (to life)!

source: يوم تبلى السرائر
en: The Day when all the secrets (deeds, prayers, fasting, etc.) will be examined (as to their truth).

source: فما له من قوة ولا ناصر
en: Then he will have no power, nor any helper.

source: والسماء ذات الرجع
en: By the sky (having rain clouds) which gives rain, again and again.

source: والأرض ذات الصدع
en: And the earth which splits (with the growth of trees and plants).

source: إنه لقول فصل
en: Verily, this (the Qur'an) is the Word that separates (the truth from falsehood, and commands strict laws for mankind to cut the roots of evil).

source: وما هو بالهزل
en: And it is not a thing for amusement.

source: إنهم يكيدون كيدا
en: Verily, they are but plotting a plot (against you O Muhammad صلى الله عليه وسلم).

source: وأكيد كيدا
en: And I (too) am planning a plan.

source: فمهل الكافرين أمهلهم رويدا
en: So give a respite to the disbelievers; deal gently with them for a while.

source: سبح اسم ربك الأعلى
en: Glorify the Name of your Lord, the Most High,

source: الذي خلق فسوى
en: Who has created (everything), and then proportioned it.

source: والذي قدر فهدى
en: And Who has measured (preordainments for everything even to be blessed or wretched); and then guided (i.e. showed mankind the right as well as the wrong paths, and guided the animals to pasture).

source: والذي أخرج المرعى
en: And Who brings out the pasturage,

source: فجعله غثاء أحوى
en: And then makes it dark stubble.

source: سنقرئك فلا تنسى
en: We shall make you to recite (the Qur'an), so you (O Muhammad صلى الله عليه وسلم) shall not forget (it),

source: إلا ما شاء الله إنه يعلم الجهر وما يخفى
en: Except what Allah may will. He knows what is apparent and what is hidden.

source: ونيسرك لليسرى
en: And We shall make easy for you (O Muhammad صلى الله عليه وسلم) the easy way (i.e. the doing of righteous deeds).

source: فذكر إن نفعت الذكرى
en: Therefore remind (men) in case the reminder profits (them).

source: سيذكر من يخشى
en: The reminder will be received by him who fears (Allah),

source: ويتجنبها الأشقى
en: But it will be avoided by the wretched,

source: الذي يصلى النار الكبرى
en: Who will enter the great Fire (and will be made to taste its burning).

source: ثم لا يموت فيها ولا يحيى
en: There he will neither die (to be in rest) nor live (a good living).

source: قد أفلح من تزكى
en: Indeed whosoever purifies himself (by avoiding polytheism and accepting Islamic Monotheism) shall achieve success,

source: وذكر اسم ربه فصلى
en: And remembers (glorifies) the Name of his Lord (worships none but Allah), and prays (five compulsory prayers and Nawafil - additional prayers).

source: بل تؤثرون الحياة الدنيا
en: Nay, you prefer the life of this world,

source: والآخرة خير وأبقى
en: Although the Hereafter is better and more lasting.

source: إن هذا لفي الصحف الأولى
en: Verily, this is in the former Scriptures -

source: صحف إبراهيم وموسى
en: The Scriptures of Ibrahim (Abraham) and Musa (Moses) (عليهما السلام).

source: هل أتاك حديث الغاشية
en: Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?

source: وجوه يومئذ خاشعة
en: Some faces, that Day will be humiliated (in the Hell-fire, i.e. the faces of all disbelievers, Jews and Christians).

source: عاملة ناصبة
en: Labouring (hard in the worldly life by worshipping others besides Allah), weary (in the Hereafter with humility and disgrace).

source: تصلى نارا حامية
en: They will enter in the hot blazing Fire.

source: تسقى من عين آنية
en: They will be given to drink from a boiling spring,

source: ليس لهم طعام إلا من ضريع
en: No food will there be for them but a poisonous thorny plant,

source: لا يسمن ولا يغني من جوع
en: Which will neither nourish nor avail against hunger.

source: وجوه يومئذ ناعمة
en: (Other) faces that Day will be joyful,

source: لسعيها راضية
en: Glad with their endeavour (for their good deeds which they did in this world, along with the true Faith of Islamic Monotheism).

source: لا تسمع فيها لاغية
en: Where they shall neither hear harmful speech nor falsehood.

source: فيها عين جارية
en: Therein will be a running spring.

source: فيها سرر مرفوعة
en: Therein will be thrones raised high.

source: وأكواب موضوعة
en: And cups set at hand.

source: ونمارق مصفوفة
en: And cushions set in rows.

source: وزرابي مبثوثة
en: And rich carpets (all) spread out.

source: أفلا ينظرون إلى الإبل كيف خلقت
en: Do they not look at the camels, how they are created?

source: وإلى السماء كيف رفعت
en: And at the heaven, how it is raised?

source: وإلى الجبال كيف نصبت
en: And at the mountains, how they are rooted (and fixed firm)?

source: وإلى الأرض كيف سطحت
en: And at the earth, how it is outspread?

source: فذكر إنما أنت مذكر
en: So remind them (O Muhammad صلى الله عليه وسلم) - you are only one who reminds.

source: لست عليهم بمصيطر
en: You are not a dictator over them -

source: إلا من تولى وكفر
en: Save the one who turns away and disbelieves.

source: فيعذبه الله العذاب الأكبر
en: Then Allah will punish him with the greatest punishment.

source: إن إلينا إيابهم
en: Verily, to Us will be their return;

source: ثم إن علينا حسابهم
en: Then verily, for Us will be their reckoning.

source: والفجر
en: By the dawn;

source: وليال عشر
en: By the ten nights (i.e. the first ten days of the month of Dhul-Hijjah) ,

source: والشفع والوتر
en: And by the even and the odd (of all the creations of Allah).

source: والليل إذا يسر
en: And by the night when it departs.

source: هل في ذلك قسم لذي حجر
en: There is indeed in them (the above oaths) sufficient proofs for men of understanding (and that, they should avoid all kinds of sins and disbeliefs)!

source: ألم تر كيف فعل ربك بعاد
en: Saw you (O Muhammad صلى الله عليه وسلم) not how your Lord dealt with 'Ad (people)

source: إرم ذات العماد
en: Of Iram (who were very tall) like (lofty) pillars,

source: التي لم يخلق مثلها في البلاد
en: The like of which were not created in the land?

source: وثمود الذين جابوا الصخر بالواد
en: And (with) Thamud (people), who hewed out rocks in the valley (to make dwellings)?

source: وفرعون ذي الأوتاد
en: And (with) Fir'aun (Pharaoh) who had the stakes (to torture men by binding them to the stakes)?

source: الذين طغوا في البلاد
en: Who did transgress beyond bounds in the lands (in the disobedience of Allah).

source: فأكثروا فيها الفساد
en: And made therein much mischief.

source: فصب عليهم ربك سوط عذاب
en: So your Lord poured on them different kinds of severe torment.

source: إن ربك لبالمرصاد
en: Verily, your Lord is Ever Watchful (over them).

source: فأما الإنسان إذا ما ابتلاه ربه فأكرمه ونعمه فيقول ربي أكرمن
en: As for man, when his Lord tries him by giving him honour and bounties, then he says (in exultation): "My Lord has honoured me."

source: وأما إذا ما ابتلاه فقدر عليه رزقه فيقول ربي أهانن
en: But when He tries him by straitening his means of life, he says: "My Lord has humiliated me!"

source: كلا بل لا تكرمون اليتيم
en: Nay! But you treat not the orphans with kindness and generosity (i.e. you neither treat them well, nor give them their exact right of inheritance)!

source: ولا تحاضون على طعام المسكين
en: And urge not one another on the feeding of Al-Miskin (the poor)!

source: وتأكلون التراث أكلا لما
en: And you devour the inheritance all with greed.

source: وتحبون المال حبا جما
en: And you love wealth with much love.

source: كلا إذا دكت الأرض دكا دكا
en: Nay! When the earth is ground to powder.

source: وجاء ربك والملك صفا صفا
en: And your Lord comes with the angels in rows.

source: وجيء يومئذ بجهنم يومئذ يتذكر الإنسان وأنى له الذكرى
en: And Hell will be brought near that Day. On that Day will man remember, but how will that remembrance (then) avail him?

source: يقول يا ليتني قدمت لحياتي
en: He will say: "Alas! Would that I had sent forth (good deeds) for (this) my life!"

source: فيومئذ لا يعذب عذابه أحد
en: So on that Day none will punish as He will punish.

source: ولا يوثق وثاقه أحد
en: And none will bind (the wicked, disbelievers and polytheists) as He will bind.

source: يا أيتها النفس المطمئنة
en: (It will be said to the pious believers of Islamic Monotheism): "O (you) the one in (complete) rest and satisfaction!

source: ارجعي إلى ربك راضية مرضية
en: "Come back to your Lord well-pleased (yourself) and well-pleasing (unto Him)!

source: فادخلي في عبادي
en: "Enter you then among My (honoured) slaves,

source: وادخلي جنتي
en: "And enter you My Paradise!"

source: لا أقسم بهذا البلد
en: I swear by this city (Makkah);

source: وأنت حل بهذا البلد
en: And you are free (from sin, and to punish the enemies of Islam on the Day of the conquest) in this city (Makkah).

source: ووالد وما ولد
en: And by the begetter (i.e. Adam عليه السلام) and that which he begot (i.e. his progeny).

source: لقد خلقنا الإنسان في كبد
en: Verily, We have created man in toil.

source: أيحسب أن لن يقدر عليه أحد
en: Does he think that none can overcome him?

source: يقول أهلكت مالا لبدا
en: He says (boastfully): "I have wasted wealth in abundance!"

source: أيحسب أن لم يره أحد
en: Does he think that none sees him?

source: ألم نجعل له عينين
en: Have We not made for him two eyes,

source: ولسانا وشفتين
en: And a tongue and two lips?

source: وهديناه النجدين
en: And shown him the two ways (good and evil)?

source: فلا اقتحم العقبة
en: But he has not attempted to pass on the path that is steep (i.e. the path which will lead to goodness and success).

source: وما أدراك ما العقبة
en: And what will make you know the path that is steep?

source: فك رقبة
en: (It is) freeing a neck (slave)

source: أو إطعام في يوم ذي مسغبة
en: Or giving food in a day of hunger (famine),

source: يتيما ذا مقربة
en: To an orphan near of kin.

source: أو مسكينا ذا متربة
en: Or to a Miskin (poor) cleaving to dust (out of misery).

source: ثم كان من الذين آمنوا وتواصوا بالصبر وتواصوا بالمرحمة
en: Then he became one of those who believed (in the Islamic Monotheism) and recommended one another to perseverance and patience, and (also) recommended one another to pity and compassion.

source: أولئك أصحاب الميمنة
en: They are those on the Right Hand (i.e. the dwellers of Paradise),

source: والذين كفروا بآياتنا هم أصحاب المشأمة
en: But those who disbelieved in Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), they are those on the Left Hand (the dwellers of Hell).

source: عليهم نار مؤصدة
en: The Fire will be shut over them (i.e. they will be enveloped by the Fire without any opening or window or outlet.

source: والشمس وضحاها
en: By the sun and its brightness.

source: والقمر إذا تلاها
en: By the moon as it follows it (the sun).

source: والنهار إذا جلاها
en: By the day as it shows up (the sun's) brightness.

source: والليل إذا يغشاها
en: By the night as it conceals it (the sun).

source: والسماء وما بناها
en: By the heaven and Him Who built it.

source: والأرض وما طحاها
en: By the earth and Him Who spread it.

source: ونفس وما سواها
en: By Nafs (Adam or a person or a soul), and Him Who perfected him in proportion;

source: فألهمها فجورها وتقواها
en: Then He showed him what is wrong for him and what is right for him.

source: قد أفلح من زكاها
en: Indeed he succeeds who purifies his ownself (i.e. obeys and performs all that Allah ordered, by following the true Faith of Islamic Monotheism and by doing righteous good deeds).

source: وقد خاب من دساها
en: And indeed he fails who corrupts his ownself (i.e. disobeys what Allah has ordered by rejecting the true Faith of Islamic Monotheism or by following polytheism or by doing every kind of evil wicked deeds).
